# 合同封面
schema_sg_cover = ["合同名称", "所属标段", "合同编号", "发包单位名称", "承建单位名称", "开始时间"]

# 合同协议书
schema_sg_protocol = ["合同名称", "合同价", "合同工期", "开始时间", "所属标段", "合同编号", "签订时间",
                      "支付周期", "对应概算", "发包单位名称", "承建单位名称", "项目负责人", "项目技术负责人", 
                      "项目设计负责人", "项目安全负责人", "项目质量负责人", "项目施工负责人", "法定代表人"]

# 专有
schema_sg_special = ['考勤条款', '人员变更条款', '分包约定']

# 施工蓝图
schema_bp = ["核定", "审查", "校核", "设计", "制图", "工程名称", "部分", "阶段", "桩号", "图名", "日期", "图号", "设计院名称"]

# 质量检测表
schema_qc = ["报告编号", "样品编号", "委托日期", "委托单位", "工程结构部位", "强度等级", "抗压强度平均值", "达到设计强度", "制作日期", "委托人", "取证人"]

# 质量评定表
schema_qe = ["单位工程名称", "单元工程量", "工序编号", "工序名称", "分部工程名称", "施工单位", "单元工程名称部位", "施工日期", "监理单位复核意见", "质量评定结果"]
